package com.example.asus.probazaizpit;

import java.util.ArrayList;

public class Constants {

    private static Cat cat;
    public static ArrayList <Cat> cats = new ArrayList <>();
    public static ArrayList <Cat> myCats = new ArrayList <>();
    private static ArrayList <String> imgUrl = new ArrayList <>();
    private static ArrayList <String> nameCat = new ArrayList <>();
    private static ArrayList <String> infoCat = new ArrayList <>();

    public static final String LIKE = "LIKE";
    public static final String DISLIKE = "DISLIKE";

    private static final String Manchkin_Url = "https://doo.bg/wp-content/uploads/2016/12/%D0%BA%D0%BE%D1%82%D0%BA%D0%B0-%D0%BC%D0%B0%D0%BD%D0%BA%D1%87%D0%B0%D0%BD.jpg";
    private static final String Turkish_Url = "https://doo.bg/wp-content/uploads/2016/12/angorska-kotka.jpg";
    private static final String Persian_Url = "https://doo.bg/wp-content/uploads/2016/12/PERSIJSKA-KOTKA.jpg";
    private static final String Syberian_Url = "https://doo.bg/wp-content/uploads/2016/12/SIBIRSKA-KOTKA.jpg";
    private static final String Curl_Url = "https://doo.bg/wp-content/uploads/2016/12/AMERIKANSKI-KERL.jpg";
    private static final String Mekong_Url = "https://doo.bg/wp-content/uploads/2016/12/mekong-bobtail.jpg";
    private static final String Singaporian_Url = "https://doo.bg/wp-content/uploads/2016/12/singapurska-kotka.jpg";
    private static final String Selkork_Url = "https://doo.bg/wp-content/uploads/2016/12/%D0%A1%D0%B5%D0%BB%D0%BA%D0%B8%D1%80%D0%BA-%D1%80%D0%B5%D0%BA%D1%81.jpg";
    private static final String Russian_blue_Url = "https://doo.bg/wp-content/uploads/2016/12/%D0%A0%D0%A3%D0%A1%D0%9A%D0%90-%D0%A1%D0%98%D0%9D%D0%AF-%D0%9A%D0%9E%D0%A2%D0%9A%D0%90.jpg";
    private static final String Bengal_Url = "https://doo.bg/wp-content/uploads/2016/12/begalska-kotka.jpg";
    private static final String Abisinian_Url = "https://doo.bg/wp-content/uploads/2016/12/abisinska-kotka.jpg";
    private static final String Kimrik_Url = "https://doo.bg/wp-content/uploads/2016/12/cymric-1.jpg";
    private static final String American_Url = "https://doo.bg/wp-content/uploads/2016/12/amerikanska-kysokosmetska-kotka.jpg";
    private static final String Toyger_Url = "https://doo.bg/wp-content/uploads/2016/12/%D0%A2%D0%9E%D0%99%D0%93%D0%95%D0%A0.jpg";
    private static final String Manekuun_Url = "https://doo.bg/wp-content/uploads/2016/12/mejn-kuun.jpg";
    private static final String Snowshoo_Url = "https://doo.bg/wp-content/uploads/2016/12/snow1.jpg";
    private static final String Scotland_Url = "https://doo.bg/wp-content/uploads/2016/12/SHOTLANDSKA-KLEPOUHA.jpg";
    private static final String Exotic_Url = "https://doo.bg/wp-content/uploads/2016/12/ec.jpg";
    private static final String Burmila_Url = "https://doo.bg/wp-content/uploads/2016/12/%D0%91%D0%A3%D0%A0%D0%9C%D0%98%D0%9B%D0%90.jpg";
    private static final String Regdol_Url = "https://doo.bg/wp-content/uploads/2016/12/ragdoll-8.jpg.pagespeed.ce_.soXFU6o0LF.jpg";
    private static final String British_Url = "https://doo.bg/wp-content/uploads/2016/12/803540c11a5c.jpg";

    private static final String Manchkin_Name = "21 МЯСТО – МАНЧКИН";
    private static final String Turkish_Name = "20 МЯСТО ТУРСКА АНГОРСКА КОТКА";
    private static final String Persian_Name = "19 МЯСТО ПЕРСИЙСКА КОТКА";
    private static final String Syberian_Name = "18 МЯСТО СИБИРСКА КОТКА";
    private static final String Curl_Name = "17 МЯСТО АМЕРИКАНСКИ КЪРЛ";
    private static final String Mekong_Name = "16 МЯСТО МЕКОНГСКИ БОБТЕЙЛ";
    private static final String Singaporian_Name = "15 МЯСТО СИНГАПУРСКА КОТКА";
    private static final String Selkork_Name = "14 МЯСТО СЕЛКЪРК РЕКС";
    private static final String Russian_blue_Name = "13 МЯСТО РУСКА СИНЯ КОТКА";
    private static final String Bengal_Name = "12 МЯСТО БЕНГАЛСКА КОТКА";
    private static final String Abisinian_Name = "11 МЯСТО АБИСИНСКА КОТКА";
    private static final String Kimrik_Name = "10 МЯСТО КИМРИК";
    private static final String American_Name = "9 МЯСТО АМЕРИКАНСКА КЪСОКОСМЕСТА КОТКА";
    private static final String Toyger_Name = "8 МЯСТО ТОЙГЕР";
    private static final String Manekuun_Name = "7 МЯСТО МЕЙН КУУН";
    private static final String Snowshoo_Name = "6 МЯСТО СНОУШУ";
    private static final String Scotland_Name = "5 МЯСТО ШОТЛАНДСКА КЛЕПОУХА КОТКА";
    private static final String Exotic_Name = "4 МЯСТО ЕКЗОТИЧНА КЪСКОСМЕСТА КОТКА";
    private static final String Burmila_Name = "3 МЯСТО БУРМИЛА";
    private static final String Regdol_Name = "2 МЯСТО РЕГДОЛ";
    private static final String British_Name = "1 МЯСТО БРИТАНСКА КЪСОКОСМЕСТА КОТКА";

    private static final String Manchkin_Info = "Изключително интересна и необикновена порода котки с малко комичен вид. Тези котки имат  почти 2-3 пъти по-къси крака в  сравнение  с други  представители на  този вид. Тази порода се е появила не в резултат на селекция, а от спонтанна мутация през 30-те години на миналия век.\n" +
            "Поведение: Притежателите на тази порода котки отбелязват, че техните питомци не обичат много да мяукат. Изключително подвижни, съобразителни и игриви.  Обичат да вървят след стопанина си, изключително послушни и могат да се научат да изпълняват по-прости гласови команди.";
    private static final String Turkish_Info = "Една от най-древните породи дългокосмести котки, чиято родина е Турция. Често я бъркат с персийската котка, която има подобен външен вид. Турската ангорка е значително е по-малка от персийската котка, по-подвижна и стройна и с по-удължена муцуна.\n" +
            "В периода 1614 – 1624 г. по време на своето дълго пътешествие из Източна Европа, Турция, Персия и Индия италианският аристократ Пиетро дела Вале открива необикновената за Западна Европа, но доста широко разпространена порода домашни котки с дълга козина, а неговият съвременик французинът – сеньор е първият европеец, който започва да ги развъжда.Един от първите притежатели на такава екзотична котка е кардинал де Ришельо.\n" +
            "В днешно време чистокръвната ангорка е много рядко срещана в Европа , понеже повечето са кръстосани с други породи дългокосмести котки, най-вече с персийската котка.   Все пак, ако търсите чистокръвна порода на този представител, най-добре е да се ориентирате към Турция, от където е и произлязла.\n" +
            "Поведение: Спокойни, умни и предани към стопаните си. Добре се адаптират към различните начини на живот.";
    private static final String Persian_Info = "Персийката е представител на дългокосместите котки с характерна за нея сплескана муцуна, малък и широк нос. В произхода на персийската котка има много неясноти. Най-вероятно тя е резултат на кръстоска между пустинната котки и азиатската котка  обитаваща азиатските степи. Родината на персийската котка се счита Турция. Развъждането в Европа на тази порода е започнало през 16-17 век, когато е пренесена в Италия, а след това и във Франция.\n" +
            "Поведение: изключително опитомена, дори е загубила инстинкта си за лов на мишки и не може да проживява самостоятелно, като улична котка. Много любвеобилна,спокойна,  с пълно доверие към своя стопанин. Предаността й може да се сравнява с тази на кучетата.";
    private static final String Syberian_Info = "Сибирската котка е порода среднодългокосместа домашна котка, произхождаща от Сибир, Русия. По всяка вероятност произлиза от кръстоска между европейските породи котки и дивите котки в сибирските гори. Породата се е появила по естествен път и се отличава с доброто си здраве и приспособим характер..\n" +
            "Поведение: навън незвисими и отлични ловци.  В домашна обстановка са много любвеобвилни, подвижни и игриви. Много лесно се научава да използва тоалетна. Понякога проявява своенравност и не винаги отвръща на ласките на стопанина си. Не се страхува от вода и може да съжителства  с кучета от всякаква порода.";
    private static final String Curl_Info = "Едва ли ще сгрешим ако кажем, че началото на породата американски кърл е поставено през 1981 г. Тогава първите забелязани котки със завити уши били две скитащи бездомни котенца, озовали се в дома на Джо и Грейс Руга от Лейкууд, Калифорния. Стопаните обърнали внимание на странните, завити назад уши със здрав хрущял. Едното котенце поело нататък по пътя си, а другото, оказало се женско, се установило мирно на дивана.\n" +
            "След година, вече порасналата котка, наречена Суламиф, родила четири котенца. Всички те имали завити уши. Така било установено, че завитите уши са доминантен признак и са възникнали в резултат на спонтанна мутация. Завитите уши се образували на 4-7 ден след раждането. Самият завитък се разполагал на една трета от основата на ухото.\n" +
            "Поведение: смесица от преданост, нежност и любопитство. Изключително здрави и лесни за отглеждане. Игриви и любознателни дори и в по напреднала за тях възраст.";
    private static final String Mekong_Info = "Първите сиамки (а по-точно предците на трите породи сиамски котки – традиционната сиамка, балинезийската и меконг бобтейла) попадат в Европа, както е добре известно, през 1884 от столицата на Сиам Крунг Тхеп (Града на ангелите), по-късно наречен Бангког. Само десетина години по-късно сиамките попадат в Америка, а горе – долу по същото време и в царска Русия. Много от първите дошли в Европа и Америка котки със сиамска окраска имали ярко изразени чупки и завивки на опашките, което по онова време се считало за признак на така наречените „кралски сиамци”. По-късно (в началото на 20 век и особено във Великобритания) работата на развъдчиците при създаването на породата, която днес наричаме традиционна сиамка, се съсредоточава върху премахването на тези „недостатъци” по опашките на всички котки от сиамски тип.\n" +
            "Особености и характер: славят се с дълголетие, живеят около 2-25 години. Активни и плодовити през целия си живот.";
    private static final String Singaporian_Info = "Сингапурската котка пренадлежи към късокосместите породи. Тя е създадена през 1975 г. в САЩ. Както се вижда от името, котките от тази порода произхождат от Сингапур. През 1974 г. на една от сингапурските улици туристи хванали 3 интересни котки, които били транспортирани в САЩ, където предизвикали голям интерес и възхищение сред любителите на котки още на първата изложба. Нарекли ги сингапурски – на името на острова, откъдето произхождали. През следващата година семейство Медоу докарали още котки от Сингапур, а и други любители започнали да внасят от тези красиви котки. Така била сформирана основата на тази красива и интересна порода. Днес в САЩ, Англия, Япония и някои европейски страни има над 1000 сингапурски котки, с които се води целенасочена развъдна дейност, поради голямото търсене и успехите им на фелиноложки изложби.\n" +
            "Поведение: изящна, жизнерадостна, много подвижна, послушна и забавна котка. Обича децата.";
    private static final String Selkork_Info = "Американска котка Селкърк Рекс – била призната като първа породиста котка в Америка, получена от кръстосване със здравата фермерска котка. Гражданите на Америка са били горди с тази голяма котка и са водили родословен регистър за запазване на породата. Организирането на изложби във Северна Америка е подтикнало селекционирането на котки с определени физически и естетични изисквания за определена порода със стандартни качества. Американска котка Селкърк Рекс е търпелива, толерантна, любяща, В тези години породата вече се среща много рядко даже и в Америка.";
    private static final String Russian_blue_Info = "Руската синя котка е късокосместа порода домашна котка, произхождаща от Русия, близо до град Архангелск.[1] В Англия, където е и призната, е донесена около 1860 от архангелски моряци. Тогава най-често се е използвало името чужда синя котка или руски шартрьоз, като името “руска синя котка” било измислено по-късно.\n" +
            "Поведение: Интелигентна,игрива, съобразителна, с мелодично, ненатрапчиво мяукане. Поначало много резервирана и тиха, тя е недоверчива към непознати, но е много мила и нежна със стопаните си. Не обича шума, предпочита спокойния живот.";
    private static final String Bengal_Info = "Бенгальская кошка была выведена путем скрещивания азиатской леопардовой кошки с домашней породой кошек, таких как абиссинская, американская короткошерстная, бирманская кошка и египетский мяу. Бенгальские кошки любящие, преданные и очень отзывчивые по отношению к своим любимым людям. Они выстраивают прочные взаимоотношения со своими владельцами и становятся для них верными друзьями на всю жизнь. Они общаются с людьми и имеют глубокую потребность открыть им свои чувства. Несмотря на рост популярности, бенгальская порода, безусловно, кошка не для всех. Владельцы бенгальских кошек отмечают, что в характере этой породы полностью отсутствует агрессия, даже в малейшей степени.\n" +
            "Поведение и характер: много умни и игриви. Запазили са донякъде дивото в себе си. Податливи на дресировка, могат да се научат сами да включват и изключват лампи, отварят врати, пускат сами водата в тоалетната.";
    private static final String Abisinian_Info = " Абисинската котка е порода домашна котка произхождаща от дивите африкански котки населявали някогашната Абисиния, старото название на днешна  Етиопия.\n" +
            "Поведение и характер: много се привързват към стопаните си и не могат дълго време да стоят сами. Активни и подвижни. Обичат вниманието и ласките.";
    private static final String Kimrik_Info = " Породата е наречена в чест на древните келтски племена, населяващи британския остров Уелс – кимерийците, а освен това Суmric на англ. означава уелски. Както менската безопашата котка, кимрик е създадена по естествен път и е известна още отпреди няколко столетия. Дългата космена покривка от тази порода се е появила в резултат на мутация от менкса. Според някои изследователи през XVI в. чрез търговски кораби от Далечния изток били докарани азиатски безопашати котки на остров Мен в Ирландско море. На острова котките се кръстосвали и размножавали в продължение на векове, като се раждали не само късокосмести, но и дългокосмести котки.\n" +
            "Поведение и характер: спокойни и послушни.";
    private static final String American_Info = "Породата котки “Американска късокосместа” е една от най-търсените за гледане в САЩ, макар че за нейна родина се смята Англия. Тя има много сходства и може да се нарече еквивалент на “Европейската късокосместа”, която е разпространена и у нас. Тези котки са известни с отличните си ловни умения и именно поради тези ценни качества хората в миналото са ги вземали по кораби, за да ловят мишки. По този начин Американската късокосместа заедно с други животни попада на известния кораб “Мейфлауър”, с който пилигримите са пътували през периода 1621 – 1639 г от Саутхемптън, Англия до Масачузетс, Северна Америка, който впоследствие става територия на САЩ. И така, превозвани по кораби, пътуващи в различни дестинации, тази порода котки постепенно се разпространяват по целия свят.\n" +
            "Характер и поведение:изключително здрави и издържливи котки. Обичат да подскачат и са отлични ловци. Към стопаните си е ласкава, нежна и съобразителна.";
    private static final String Toyger_Info = "Тойгер (Toyger) са най-скъпите домашни котки. Породата е създадена чрез кръстосването на домшана късокосместа котка с бенгалска котка през 1980 година в Калифорния.  Приема се като дизайнерска порода котки.\n" +
            "Създателите на породата са искали котка, която да има украска на тигър. През 1993 г. породата е регистирана в TICA, но все още не е призната.\n" +
            "Характер и поведение: добри с мек характер. Много игриви в същото време, подвижни и общителни. Много предани към своите стопани.";
    private static final String Manekuun_Info = "Мейн Куун-ът, познат също като Американска Дългокосместа, е най-голямата опитомена порода котки и има доста отличителен външен вид, както и много добри умения да ловува. Тази порода е една от най-старите натурални (аборигенни) породи в Северна Америка, и по-точно в или около щата Мейн, където е официална котка на щата.\n" +
            "Характер и поведение: обича да бъде около стопанина си, но в същото време не е натрапчива.Много интелигентна и вярна на стопанина си. Защитава смело своята територия.";
    private static final String Snowshoo_Info = " Сноу шу е домашна котка, получена в резултат на кръстосването на сиамска с би-колор американска късокосместа котка през 1960 г. Нейната създателка е Дороти Хайндс-Дохърти. Породата е призната от всички котешки асоциации. Името ѝ произлиза от белите лапички, които има (от англ. snow shoe).\n" +
            "Характер и поведение: обича да бъде около своите стопани, игрива е  и обича децата.";
    private static final String Scotland_Info = "Късокосместата шотландска клепоуха котка е възникнала в резултат на спонтанна мутация в една ферма в Шотландия през 1961 г. фермерът Уилям Рос забелязал сред родените котета едно от тях, което било с подвити уши. В следващите поколения от мутанта се родили още 2 такива котета и станало очевидно, че подвитите уши са доминантен признак, който се предава по наследство. За отбелязване е, че още в старите книги по естествена история са описвани котки с клепнали уши.\n" +
            "Характер и поведение: с уравновесен характер, привързва се силно към дома и стопаните си.Изключително умна.";
    private static final String Exotic_Info = "Екзотичната късокосместа котка е резултат от кръстосването на дългокосместата персийска котка с американската късокосместа котка. Целта на американските селекционери е била да създадат котка, приличаща на персийските с характерното лицево изражение, но с къса космена покривка, неизискваща особени грижи.\n" +
            "В началото на 60-те години на 20 век в САЩ развъдчици на американски късокосмести котки започнали да ги кръстосват с персийки котки в опит за подобряването на типа. Но котенцата, които се раждали, били уникални и имали категорично различен външен вид от този, който се търсел при експеримента.\n" +
            "Характер и поведение:  Много са отзивчиви към хората и с разбиране откликват на всички човешки емоции. Породата екзотична късокосместа е наследила от предците си персийските котки общителен и нежен темперамент, но привнесената кръв от други късокосмести породи е превърнала екзотичните котки в по-весели и по-любознателни създания от дългокосместите им предци.";
    private static final String Burmila_Info = " През 1981 г. Миранда Бикфорд-Смит – баронеса фон Кирхберг, чийто развъдник „Astahazy” е добре известен сред любителите на бирманската късокосместка котка във Великобритания, подарява на съпруга си мъжката персийка с цвят чинчила Jemari Sanquist. Котаракът проявява кавалерски интерес към изящната бирманска късокосместа котка Bambino Lilac Fabergé. И скоро става ясно, че тя очаква котенца. Раждат се 4 малки дами – всичките сребристи на цвят с черен оттенък. \n" +
            "Няколко седмици по-късно баронеса Миранда фон Кирхберг и нейната приятелка Терез Кларк осъзнават, че кръстоската, която се е получила, е изключително сполучлива и переспективна. Комбинацията от двата типа толкова различни породи, впечатляващият им външен вид и чудесен темперамент била с отлични шансове за затвърждаването и отделянето на нова порода.\n" +
            "Поведение и характер: с уравновесен характер, не е агресивна в обкръжение на други котки. Обича да си играе с различни предмети.";
    private static final String Regdol_Info = "Породата е създадена през 1960 г. в Калифорния (САЩ). Произхожда от една бяла синеока персийска котка с име Жозефина, заплодена от сиамски котарак с име Регед. Бременната персийка била блъсната от автомобил и тежко ранена, но въпреки това тя успяла да роди. В нейното потомство забелязали уникалено качество. Котенцата били толкова спокойни, отпуснати и пасивни, че буквално увисвали в ръката като парцалена кукла – поради тази причина породата била наречена така (от англ. гаgdoll-парцалена кукла). Котетата, като че ли били загубили всякакво чувство за страх и били безчувствени на болка, което ги правило изключително уязвими. Те не умеели да се бият и били лесна плячка за други животни, враждебно настроени към тях. Котките от тази порода били способни да легнат да спят по средата на улицата. Тялото им не е крехко, но те трябва да бъдат пазени далеч от други животни или от деца, които могат да ги наранят.\n" +
            "Характер и поведение: съобразителни, игриви и добре съжителстват с други видове животни. Обичат да вървят след стопанина си.";
    private static final String British_Info = "Британската късокосместа котка е порода домашна котка произхождаща от Великобритания. Мъжките екземпляри тежат от 5-10 кг, а женските 5-7 кг. Има къса гъста козина и също така гъст подкосъм. Характерна е с кръглата си глава и големите си кръгли очи. Тялото ѝ е с “квадратна” форма. Очите са големи и закръглени. Ушите са с леко заострени връхчета и отдалечени. Нейните черти я правят популярна порода за участие в котешки шоута.\n" +
            "Характер и поведение: Силни, умни и актвни. Отличават се от другите породи със своята независимост. Много ловки и бързи ловци. Мяукат рядко, а ако го правят е достатъчно тихо и ненатрапващо.";


    private static void fillList() {

        imgUrl.add( Manchkin_Url );
        imgUrl.add( Turkish_Url );
        imgUrl.add( Persian_Url );
        imgUrl.add( Syberian_Url );
        imgUrl.add( Curl_Url );
        imgUrl.add( Mekong_Url );
        imgUrl.add( Singaporian_Url );
        imgUrl.add( Selkork_Url );
        imgUrl.add( Russian_blue_Url );
        imgUrl.add( Bengal_Url );
        imgUrl.add( Abisinian_Url );
        imgUrl.add( Kimrik_Url );
        imgUrl.add( American_Url );
        imgUrl.add( Toyger_Url );
        imgUrl.add( Manekuun_Url );
        imgUrl.add( Snowshoo_Url );
        imgUrl.add( Scotland_Url );
        imgUrl.add( Exotic_Url );
        imgUrl.add( Burmila_Url );
        imgUrl.add( Regdol_Url );
        imgUrl.add( British_Url );

        nameCat.add( Manchkin_Name );
        nameCat.add( Turkish_Name );
        nameCat.add( Persian_Name );
        nameCat.add( Syberian_Name );
        nameCat.add( Curl_Name );
        nameCat.add( Mekong_Name );
        nameCat.add( Singaporian_Name );
        nameCat.add( Selkork_Name );
        nameCat.add( Russian_blue_Name );
        nameCat.add( Bengal_Name );
        nameCat.add( Abisinian_Name );
        nameCat.add( Kimrik_Name );
        nameCat.add( American_Name );
        nameCat.add( Toyger_Name );
        nameCat.add( Manekuun_Name );
        nameCat.add( Snowshoo_Name );
        nameCat.add( Scotland_Name );
        nameCat.add( Exotic_Name );
        nameCat.add( Burmila_Name );
        nameCat.add( Regdol_Name );
        nameCat.add( British_Name );

        infoCat.add( Manchkin_Info );
        infoCat.add( Turkish_Info );
        infoCat.add( Persian_Info );
        infoCat.add( Syberian_Info );
        infoCat.add( Curl_Info );
        infoCat.add( Mekong_Info );
        infoCat.add( Singaporian_Info );
        infoCat.add( Selkork_Info );
        infoCat.add( Russian_blue_Info );
        infoCat.add( Bengal_Info );
        infoCat.add( Abisinian_Info );
        infoCat.add( Kimrik_Info );
        infoCat.add( American_Info );
        infoCat.add( Toyger_Info );
        infoCat.add( Manekuun_Info );
        infoCat.add( Snowshoo_Info );
        infoCat.add( Scotland_Info );
        infoCat.add( Exotic_Info );
        infoCat.add( Burmila_Info );
        infoCat.add( Regdol_Info );
        infoCat.add( British_Info );


    }

    private static void fillCatList() {
        for (int i = 0; i < imgUrl.size(); i++) {
            String catsURL = imgUrl.get( i );
            String catsName = nameCat.get( i );
            String catsInfo = infoCat.get( i );

            cat = new Cat( catsURL, catsName, catsInfo, false );
            cats.add( cat );

        }
    }

    public static void getFillList() {
        fillList();
    }

    public static void getFillCatList() {
        fillCatList();
    }

    public static ArrayList <Cat> getCats() {
        return cats;
    }

    public static ArrayList <Cat> getMyCats() {
        return myCats;
    }
}